EnergizeLab/ServoSDK/C/STM32F103C8T6/PrimaryMemoryTable/Example/User/main.c
#include "stm32f10x.h"
#include "platform_config.h"
#include "PrimaryServo.h"
#include "stm32f10x_usart.h"
#include <stdio.h>

#define PING_TEST 0   								//PING Instruction Test
#define READ_TEST 0										//Read Servo Data Test
#define WRITE_TEST 0									//Write Servo Data Test
#define SYNC_WRITE_TEST 0							//Sync Write Test
#define FACTORY_RESET_TEST 0					//Factory Reset Test
#define PARAMETER_RESET_TEST 0	  		//Parameter Reset Test
#define CALIBRATION_TEST 0						//Calibration Test
#define REBOOT_TEST 0									//Reboot Test
#define MODIFY_ID 0              			//Change Known Servo ID Test
#define MODIFY_UNKNOWN_ID 0       		//Change Unknown Servo ID Test

uint8_t receive_data[20];             //Store the received status packet
uint8_t receive_len;                  //received Length
uint8_t ret;                          //Status Flag
uint16_t position = 0;                //present position
uint16_t current = 0;                 //present current
uint8_t write_buffer[20] = {0};       //Write data to the memory table

extern __IO uint32_t TimingDelay;

void RCC_Configuration(void);
void GPIO_Configuration(void);
void USART1_Init(void);
void USART2_Init(void);
void USART1_Send(uint8_t *data, uint8_t data_len);
void SysTick_Configuration(void);
void Delay(__IO uint32_t nTime);

//Redirect printf
int fputc(int ch, FILE *f)
{
  USART_SendData(USART2, (uint8_t) ch);

  while (USART_GetFlagStatus(USART2, USART_FLAG_TC) == RESET)
  {}
		
	return ch;
}

int main(void)
{
	uint8_t order_buffer[20];           //Store Generated Instructions
	uint8_t order_len;                  //Instruction Length

	uint32_t analysis_data;             //Data parsed from the status packet

	SysTick_Configuration();
	RCC_Configuration();
	GPIO_Configuration();

	USART1_Init();
	
	//Information print serial port initialization
	USART2_Init();
	
	struct primary_servo_sync_parameter servo;
	
	servo.id_counts = 2;            		//Sync write two servos
  servo.id[0] = 1;                	//Set the ID of the first servo to 1
  servo.id[1] = 2;                	//Set the ID of the second servo to 2
	
  while (1)
  {
#if FACTORY_RESET_TEST
		//Reset the servo to the factory default values.
		primary_servo_factory_reset(1, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
		USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
		receive_len = 0x00;
		Delay(10);

    ret = primary_servo_factory_reset_analysis(receive_data);
		if(ret == PRIMARY_SUCCESS)
			PRINTF("factory reset complete\r\n");
		Delay(1000);
#endif			
		
#if PARAMETER_RESET_TEST
		//Reset the parameter settings of the servo.
		primary_servo_parameter_reset(1, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
		USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
		receive_len = 0x00;
		Delay(10);

    ret = primary_servo_parameter_reset_analysis(receive_data);
		if(ret == PRIMARY_SUCCESS)
			PRINTF("parameter reset complete\r\n");
		Delay(1000);
#endif			

#if CALIBRATION_TEST
		//Calibrate the midpoint of the servo.
    primary_servo_calibration(1, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
    USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
		receive_len = 0x00;
		Delay(10);
		
    ret = primary_servo_calibration_analysis(receive_data);
		if(ret == PRIMARY_SUCCESS)
			PRINTF("calibration complete\r\n");
		Delay(1000);
#endif				
		
#if REBOOT_TEST
		//Reboot the servo ID1.
    primary_servo_reboot(1, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
    USART1_Send(order_buffer, order_len);
		Delay(1000);
#endif			

#if MODIFY_ID
		//Change the servo ID of servo ID1 to 2.
    primary_servo_modify_known_id(1, 2, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
    USART1_Send(order_buffer, order_len);
		Delay(1000);
#endif

#if MODIFY_UNKNOWN_ID
		//Change the servo ID of the servo with an unknown ID to 1.
    primary_servo_modify_unknown_id(1, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
    USART1_Send(order_buffer, order_len);
		Delay(1000);
#endif

#if PING_TEST
		//Query the model number of servo ID1.
    primary_servo_ping(1, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
		USART1_Send(order_buffer, order_len);
		
		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
		receive_len = 0x00;
		Delay(10);
		
    ret = primary_servo_ping_analysis(receive_data, &analysis_data);
    if(ret == PRIMARY_SUCCESS)
			PRINTF("model number: %d\r\n", analysis_data);
		Delay(1000);
#endif

#if READ_TEST
		//Read the present current of servo ID1.
    primary_servo_read_present_current(1, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
		USART1_Send(order_buffer, order_len);
		
		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
		receive_len = 0x00;
		Delay(10);
		
    ret = primary_servo_read_present_current_analysis(receive_data, &analysis_data);
    if(ret == PRIMARY_SUCCESS)
		{
			PRINTF("present current: %d\r\n",analysis_data);
		}
		Delay(1000);
#endif

#if READ_TEST
		//Read the present position of servo ID1.
    primary_servo_read_present_position(1, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
    USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
		receive_len = 0x00;
		Delay(10);

    ret = primary_servo_read_present_position_analysis(receive_data, &analysis_data);
    if(ret == PRIMARY_SUCCESS)
		{
			PRINTF("present position: %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif
		
#if READ_TEST
    //Read the present position and present current of servo ID1.
    primary_servo_read_present_position_and_present_current(1, order_buffer, &order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
    USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
		receive_len = 0x00;
		Delay(10);

    ret = primary_servo_read_present_position_and_present_current_analysis(receive_data, &position, &current);
    if(ret == PRIMARY_SUCCESS)
		{
			PRINTF("present position: %d, present current: %d\r\n", position, current);
		}
		
		Delay(1000);
#endif


#if READ_TEST
		//Read the present velocity of servo ID1.
    primary_servo_read_present_velocity(1, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
    USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
		receive_len = 0x00;
		Delay(10);

