EnergizeLab/ServoSDK/C/STM32F103C8T6/PrimaryMemoryTable/Example/User/main.c
    ret = primary_servo_read_present_velocity_analysis(receive_data, &analysis_data);
		if(ret == PRIMARY_SUCCESS)
		{
			PRINTF("present velocity: %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif


#if READ_TEST
		//Read the present profile position of servo ID1.
    primary_servo_read_present_profile_position(1, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
    USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
		receive_len = 0x00;
		Delay(10);

    ret = primary_servo_read_present_profile_position_analysis(receive_data, &analysis_data);
		if(ret == PRIMARY_SUCCESS)
		{
			PRINTF("present profile position: %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif


#if READ_TEST
		//Read the present profile velocity of servo ID1.
    primary_servo_read_present_profile_velocity(1, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
    USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
		receive_len = 0x00;
		Delay(10);

    ret = primary_servo_read_present_profile_velocity_analysis(receive_data, &analysis_data);
		if(ret == PRIMARY_SUCCESS)
		{
			PRINTF("present profile velocity: %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif


#if READ_TEST
		//Read the present PWM of servo ID1.
    primary_servo_read_present_pwm(1, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
    USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
		receive_len = 0x00;
		Delay(10);

    ret = primary_servo_read_present_pwm_analysis(receive_data, &analysis_data);
		if(ret == PRIMARY_SUCCESS)
		{
			PRINTF("present pwm: %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif


#if READ_TEST
		//Read the present temperature of servo ID1.
    primary_servo_read_present_temperature(1, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
    USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
		receive_len = 0x00;
		Delay(10);

    ret = primary_servo_read_present_temperature_analysis(receive_data, &analysis_data);
		if(ret == PRIMARY_SUCCESS)
		{
			PRINTF("present temperature: %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif


#if READ_TEST
		//Read the present voltage of servo ID1.
    primary_servo_read_present_voltage(1, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
    USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    ret = primary_servo_read_present_voltage_analysis(receive_data, &analysis_data);
		if(ret == PRIMARY_SUCCESS)
		{
			PRINTF("present voltage: %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif


#if READ_TEST
		//Read the time base target moving time of servo ID1.
    primary_servo_read_time_base_target_moving_time(1, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
    USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    ret = primary_servo_read_time_base_target_moving_time_analysis(receive_data, &analysis_data);
		if(ret == PRIMARY_SUCCESS)
		{
			PRINTF("time base target moving time: %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif


#if READ_TEST
		//Read the time base target position of servo ID1.
    primary_servo_read_time_base_target_position(1, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
    USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    ret = primary_servo_read_time_base_target_position_analysis(receive_data, &analysis_data);
		if(ret == PRIMARY_SUCCESS)
		{
			PRINTF("time base target position: %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif

#if READ_TEST
		//Read the time base target ACC of servo ID1.
    primary_servo_read_time_base_target_acc(1, order_buffer,&order_len);   
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
    USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    ret = primary_servo_read_time_base_target_acc_analysis(receive_data, &analysis_data);
		if(ret == PRIMARY_SUCCESS)
		{
			PRINTF("time base target acc: %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif
		
#if READ_TEST
    //Read the time base target position and moving time of servo ID1.
    primary_servo_read(1, 0x3C, 4, order_buffer, &order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
    USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

		PRINTF("read time base target position and moving time status packet: ");
		for (uint8_t i = 0; i < receive_len; i++)
		{
				PRINTF("0x%02x ", receive_data[i]);
		}
		PRINTF("\r\n");
		
		Delay(1000);
#endif

#if READ_TEST
    //Read the time base target ACC, position and moving time of servo ID1.
    primary_servo_read(1, 0x3B, 5, order_buffer, &order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
    USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

		PRINTF("read time base target acc, position and moving time status packet: ");
		for (uint8_t i = 0; i < receive_len; i++)
		{
				PRINTF("0x%02x ", receive_data[i]);
		}
		PRINTF("\r\n");
		
		Delay(1000);
#endif

#if READ_TEST
		//Read the velocity base target DEC of servo ID1.
    primary_servo_read_velocity_base_target_dec(1, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
    USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);
		
    ret = primary_servo_read_velocity_base_target_dec_analysis(receive_data, &analysis_data);
		if(ret == PRIMARY_SUCCESS)
		{
			PRINTF("velocity base target dec: %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif


#if READ_TEST
		//Read the velocity base target ACC of servo ID1.
    primary_servo_read_velocity_base_target_acc(1, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
    USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

