EnergizeLab/ServoSDK/C/STM32F103C8T6/PrimaryMemoryTable/Example/User/main.c
    ret = primary_servo_read_velocity_base_target_acc_analysis(receive_data, &analysis_data);
		if(ret == PRIMARY_SUCCESS)
		{
			PRINTF("velocity base target acc: %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif


#if READ_TEST
		//Read the velocity base target velocity of servo ID1.
    primary_servo_read_velocity_base_target_velocity(1, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
    USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    ret = primary_servo_read_velocity_base_target_velocity_analysis(receive_data, &analysis_data);
		if(ret == PRIMARY_SUCCESS)
		{
			PRINTF("velocity base target velocity: %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif


#if READ_TEST
		//Read the velocity base target position of servo ID1.
    primary_servo_read_velocity_base_target_position(1, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
    USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    ret = primary_servo_read_velocity_base_target_position_analysis(receive_data, &analysis_data);
		if(ret == PRIMARY_SUCCESS)
		{
			PRINTF("velocity base target position: %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif
		
#if READ_TEST
    //Read the velocity base target position and velocity of servo ID1.
    primary_servo_read(1, 0x35, 4, order_buffer, &order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
    USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    PRINTF("read velocity base target position and velocity status packet: ");
		for (uint8_t i = 0; i < receive_len; i++)
		{
				PRINTF("0x%02x ", receive_data[i]);
		}
		PRINTF("\r\n");
		
		Delay(1000);
#endif

#if READ_TEST
    //Read the velocity base target position, velocity, ACC, and DEC of servo ID1.
    primary_servo_read(1, 0x35, 6, order_buffer, &order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
    USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    PRINTF("read velocity base target position, velocity, acc and dec status packet: ");
		for (uint8_t i = 0; i < receive_len; i++)
		{
				PRINTF("0x%02x ", receive_data[i]);
		}
		PRINTF("\r\n");
		
		Delay(1000);
#endif

#if READ_TEST
		//Read the target current of servo ID1.
    primary_servo_read_target_current(1, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
    USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    ret = primary_servo_read_target_current_analysis(receive_data, &analysis_data);
		if(ret == PRIMARY_SUCCESS)
		{
			PRINTF("target current: %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif


#if READ_TEST
		//Read the target PWM of servo ID1.
    primary_servo_read_target_pwm(1, order_buffer,&order_len);  
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
    USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    ret = primary_servo_read_target_pwm_analysis(receive_data, &analysis_data);
		if(ret == PRIMARY_SUCCESS)
		{
			PRINTF("target pwm: %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif


#if READ_TEST
		//Read the torque switch of servo ID1.
    primary_servo_read_torque_switch(1, order_buffer,&order_len);  
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
    USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    ret = primary_servo_read_torque_switch_analysis(receive_data, &analysis_data);
		if(ret == PRIMARY_SUCCESS)
		{
			PRINTF("torque switch: %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif


#if READ_TEST
		//Read the LED switch of servo ID1.
    primary_servo_read_led_switch(1, order_buffer,&order_len);   
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
    USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    ret = primary_servo_read_led_switch_analysis(receive_data, &analysis_data);
		if(ret == PRIMARY_SUCCESS)
		{
			PRINTF("led switch: %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif

#if READ_TEST
		//Read the Flash switch of servo ID1.
    primary_servo_read_flash_switch(1, order_buffer,&order_len); 
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
    USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    ret = primary_servo_read_flash_switch_analysis(receive_data, &analysis_data);
		if(ret == PRIMARY_SUCCESS)
		{
			PRINTF("flash switch: %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif

#if READ_TEST
		//Read the calibration of servo ID1.
    primary_servo_read_calibration(1, order_buffer,&order_len);  
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
    USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    ret = primary_servo_read_calibration_analysis(receive_data, &analysis_data);
		if(ret == PRIMARY_SUCCESS)
		{
			PRINTF("calibration: %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif


#if READ_TEST
		//Read the control mode of servo ID1.
    primary_servo_read_control_mode(1, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
    USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    ret = primary_servo_read_control_mode_analysis(receive_data, &analysis_data);
		if(ret == PRIMARY_SUCCESS)
		{
			PRINTF("control mode: %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif


#if READ_TEST
		//Read the shutdown condition of servo ID1.
    primary_servo_read_shutdown_condition(1, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
    USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    ret = primary_servo_read_shutdown_condition_analysis(receive_data, &analysis_data);
		if(ret == PRIMARY_SUCCESS)
		{
			PRINTF("shutdown condition: %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif


#if READ_TEST
		//Read the LED condition of servo ID1.
    primary_servo_read_led_condition(1, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
    USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

