EnergizeLab/ServoSDK/C/STM32F103C8T6/PrimaryMemoryTable/Example/User/main.c
    ret = primary_servo_read_led_condition_analysis(receive_data, &analysis_data);
		if(ret == PRIMARY_SUCCESS)
		{
			PRINTF("led condition: %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif


#if READ_TEST
		//Read the position control D gain of servo ID1.
    primary_servo_read_position_control_d_gain(1, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
    USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    ret = primary_servo_read_position_control_d_gain_analysis(receive_data, &analysis_data);
		if(ret == PRIMARY_SUCCESS)
		{
			PRINTF("position control d gain: %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif


#if READ_TEST
		//Read the position control I gain of servo ID1.
    primary_servo_read_position_control_i_gain(1, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
    USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    ret = primary_servo_read_position_control_i_gain_analysis(receive_data, &analysis_data);
		if(ret == PRIMARY_SUCCESS)
		{
			PRINTF("position control i gain: %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif


#if READ_TEST
		//Read the position control P gain of servo ID1.
    primary_servo_read_position_control_p_gain(1, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
    USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    ret = primary_servo_read_position_control_p_gain_analysis(receive_data, &analysis_data);
		if(ret == PRIMARY_SUCCESS)
		{
			PRINTF("position control p gain: %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif
			
#if READ_TEST
    //Read the position control PID gain of servo ID1.
    primary_servo_read(1, 0x1B, 6, order_buffer, &order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
    USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    PRINTF("read position control pid gain status packet: ");
		for (uint8_t i = 0; i < receive_len; i++)
		{
				PRINTF("0x%02x ", receive_data[i]);
		}
		PRINTF("\r\n");
		
		Delay(1000);
#endif

#if READ_TEST
		//Read the PWM punch of servo ID1.
    primary_servo_read_pwm_punch(1, order_buffer,&order_len); 
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
    USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    ret = primary_servo_read_pwm_punch_analysis(receive_data, &analysis_data);
		if(ret == PRIMARY_SUCCESS)
		{
			PRINTF("pwm punch: %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif


#if READ_TEST
		//Read the ccw deadband of servo ID1.
    primary_servo_read_ccw_deadband(1, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
    USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    ret = primary_servo_read_ccw_deadband_analysis(receive_data, &analysis_data);
		if(ret == PRIMARY_SUCCESS)
		{
			PRINTF("ccw deadband: %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif


#if READ_TEST
		//Read the cw deadband of servo ID1.
    primary_servo_read_cw_deadband(1, order_buffer,&order_len); 
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
    USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    ret = primary_servo_read_cw_deadband_analysis(receive_data, &analysis_data);
		if(ret == PRIMARY_SUCCESS)
		{
			PRINTF("cw deadband: %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif


#if READ_TEST
		//Read the current shutdown time of servo ID1.
    primary_servo_read_current_shutdown_time(1, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
    USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    ret = primary_servo_read_current_shutdown_time_analysis(receive_data, &analysis_data);
		if(ret == PRIMARY_SUCCESS)
		{
			PRINTF("current shutdown time: %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif


#if READ_TEST
		//Read the max current limit of servo ID1.
    primary_servo_read_max_current_limit(1, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
    USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    ret = primary_servo_read_max_current_limit_analysis(receive_data, &analysis_data);
		if(ret == PRIMARY_SUCCESS)
		{
			PRINTF("max current limit: %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif


#if READ_TEST
		//Read the max PWM limit of servo ID1.
    primary_servo_read_max_pwm_limit(1, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
    USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    ret = primary_servo_read_max_pwm_limit_analysis(receive_data, &analysis_data);
		if(ret == PRIMARY_SUCCESS)
		{
			PRINTF("max pwm limit: %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif


#if READ_TEST
		//Read the max voltage limit of servo ID1.
    primary_servo_read_max_voltage_limit(1, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
    USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    ret = primary_servo_read_max_voltage_limit_analysis(receive_data, &analysis_data);
		if(ret == PRIMARY_SUCCESS)
		{
			PRINTF("max voltage limit: %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif


#if READ_TEST
		//Read the min voltage limit of servo ID1.
    primary_servo_read_min_voltage_limit(1, order_buffer,&order_len);   
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
    USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    ret = primary_servo_read_min_voltage_limit_analysis(receive_data, &analysis_data);
		if(ret == PRIMARY_SUCCESS)
		{
			PRINTF("min voltage limit: %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif
		
#if READ_TEST
    //Read the voltage limit of servo ID1.
    primary_servo_read(1, 0x10, 2, order_buffer, &order_len); 
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
    USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    PRINTF("read voltage limit status packet: ");
		for (uint8_t i = 0; i < receive_len; i++)
		{
				PRINTF("0x%02x ", receive_data[i]);
		}
		PRINTF("\r\n");
		
		Delay(1000);
#endif


#if READ_TEST
		//Read the max temperature limit of servo ID1.
    primary_servo_read_max_temperature_limit(1, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
    USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);
		
