EnergizeLab/ServoSDK/C/STM32F103C8T6/PrimaryMemoryTable/Example/User/main.c
		primary_servo_sync_write_velocity_base_target_acc_dec_velocity_and_position(servo, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
    USART1_Send(order_buffer, order_len);
		PRINTF("sync write velocity base target acc, dec, velocity and position complete\r\n");
		Delay(1000);

#endif

#if SYNC_WRITE_TEST
    //Change the torque switch of the servo ID1, ID2 to OFF respectively.
    servo.torque_switch[0] = 0;
    servo.torque_switch[1] = 0;
		primary_servo_sync_write_torque_switch(servo, order_buffer, &order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
    USART1_Send(order_buffer, order_len);
		PRINTF("sync write torque switch complete\r\n");
		Delay(1000);
#endif

#if SYNC_WRITE_TEST
    //Change the control mode of the servo ID1, ID2 to time base position control mode respectively.
    servo.control_mode[0] = 0;
    servo.control_mode[1] = 0;
    primary_servo_sync_write_control_mode(servo, order_buffer, &order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
    USART1_Send(order_buffer, order_len);
		PRINTF("sync write control mode complete\r\n");
		Delay(1000);
#endif

#if SYNC_WRITE_TEST
		//Change the time base target ACC of servo ID1 to 1 and 5 respectively.
    servo.acc_velocity_grade[0] = 1;
    servo.acc_velocity_grade[1] = 5;
		
    primary_servo_sync_write_time_base_target_acc(servo, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
		USART1_Send(order_buffer, order_len);
		PRINTF("sync write time base target acc complete\r\n");
		Delay(1000);
#endif

#if SYNC_WRITE_TEST
		//Change the time base target position and moving time of servo ID1 to 150° midpoint and 1s, 0° and 500ms respectively.
    servo.position[0] = 1500;
    servo.position[1] = 0;
    servo.time[0] = 1000;
    servo.time[1] = 500;
		
		primary_servo_sync_write_time_base_target_position_and_moving_time(servo, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
    USART1_Send(order_buffer, order_len);
		PRINTF("sync write time base target position and moving time complete\r\n");
		Delay(1000);
#endif

#if WRITE_TEST
		//Change the return level of servo ID1 to respond to all instruction.
    primary_servo_set_return_level(1, 2, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
		USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    ret = primary_servo_set_return_level_analysis(receive_data);
		if(ret == PRIMARY_SUCCESS)
			PRINTF("write return level complete\r\n");
		Delay(1000);
#endif

#if WRITE_TEST
    //Change the return delay time of servo ID1 to 500us.
		primary_servo_set_return_delay_time(1, 250,order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
		USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    ret = primary_servo_set_return_delay_time_analysis(receive_data);
		if(ret == PRIMARY_SUCCESS)
			PRINTF("write return delay time complete\r\n");
		Delay(1000);
#endif

#if WRITE_TEST
    //Change the baud rate of servo ID1 to 1000000.
    primary_servo_set_baud_rate(1, 7, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
		USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    ret = primary_servo_set_baud_rate_analysis(receive_data);
		if(ret == PRIMARY_SUCCESS)
			PRINTF("write baud rate complete\r\n");
		Delay(1000);
#endif

#if WRITE_TEST
    //Change the min angle limit of servo ID1 to 0°.
    primary_servo_set_min_angle_limit(1, 0, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
		USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    ret = primary_servo_set_min_angle_limit_analysis(receive_data);
		if(ret == PRIMARY_SUCCESS)
			PRINTF("write min angle limit complete\r\n");
		Delay(1000);
#endif

#if WRITE_TEST
    //Change the max angle limit of servo ID1 to 300°.
    primary_servo_set_max_angle_limit(1, 3000, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
		USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    ret = primary_servo_set_max_angle_limit_analysis(receive_data);
		if(ret == PRIMARY_SUCCESS)
			PRINTF("write max angle limit complete\r\n");
		Delay(1000);
#endif
		
#if WRITE_TEST
    //Change the angle limit of servo ID1 to 0°~300°.
    write_buffer[0] = 0 & 0xff;;
    write_buffer[1] = (0 >> 8) & 0xff;
    write_buffer[2] = 3000 & 0xff;
    write_buffer[3] = (3000 >> 8) & 0xff;
		primary_servo_write(1, 0x0B, 4, write_buffer, order_buffer, &order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
		USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    PRINTF("write angle limit status packet: ");
		for (uint8_t i = 0; i < receive_len; i++)
		{
				PRINTF("0x%02x ", receive_data[i]);
		}
		PRINTF("\r\n");
		Delay(1000);
#endif

#if WRITE_TEST
    //Change the max temperature limit of servo ID1 to 65℃.
    primary_servo_set_max_temperature_limit(1, 65, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
		USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    ret = primary_servo_set_max_temperature_limit_analysis(receive_data);
		if(ret == PRIMARY_SUCCESS)
			PRINTF("write max temperature limit complete\r\n");
		Delay(1000);
#endif

#if WRITE_TEST
    //Change the max voltage limit of servo ID1 to 8.4V.
    primary_servo_set_max_voltage_limit(1,84, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
		USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    ret = primary_servo_set_max_voltage_limit_analysis(receive_data);
		if(ret == PRIMARY_SUCCESS)
			PRINTF("write max voltage limit complete\r\n");
		Delay(1000);
#endif

#if WRITE_TEST
    //Change the min voltage limit of servo ID1 to 3.5V.
    primary_servo_set_min_voltage_limit(1, 35, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
		USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

