EnergizeLab/ServoSDK/C/STM32F103C8T6/PrimaryMemoryTable/Example/User/main.c
    ret = primary_servo_set_min_voltage_limit_analysis(receive_data);
		if(ret == PRIMARY_SUCCESS)
			PRINTF("write min voltage limit complete\r\n");
		Delay(1000);
#endif
		
#if WRITE_TEST
    //Change the voltage limit of servo ID1 to 3.5~8.4V.
    write_buffer[0] = 84 & 0xff;
    write_buffer[1] = 35 & 0xff;
    primary_servo_write(1, 0x10, 2, write_buffer, order_buffer, &order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
		USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    PRINTF("write voltage limit status packet: ");
		for (uint8_t i = 0; i < receive_len; i++)
		{
				PRINTF("0x%02x ", receive_data[i]);
		}
		PRINTF("\r\n");
		Delay(1000);
#endif

#if WRITE_TEST
    //Change the max PWM limit of servo ID1 to 90%.
    primary_servo_set_max_pwm_limit(1, 900, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
		USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    ret = primary_servo_set_max_pwm_limit_analysis(receive_data);
		if(ret == PRIMARY_SUCCESS)
			PRINTF("write max pwm limit complete\r\n");
		Delay(1000);
#endif

#if WRITE_TEST
    //Change the max current limit of servo ID1 to 900mA.
    primary_servo_set_max_current_limit(1, 900, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
		USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    ret = primary_servo_set_max_current_limit_analysis(receive_data);
		if(ret == PRIMARY_SUCCESS)
			PRINTF("write max current limit complete\r\n");
		Delay(1000);
#endif

#if WRITE_TEST
    //Change the current shutdown time of servo ID1 to 500ms.
    primary_servo_set_current_shutdown_time(1, 500, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
		USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    ret = primary_servo_set_current_shutdown_time_analysis(receive_data);
		if(ret == PRIMARY_SUCCESS)
			PRINTF("write current shutdown time complete\r\n");
		Delay(1000);
#endif

#if WRITE_TEST
    //Change the CW deadband of servo ID1 to 0.2°.
    primary_servo_set_cw_deadband(1, 2, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
		USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    ret = primary_servo_set_cw_deadband_analysis(receive_data);
		if(ret == PRIMARY_SUCCESS)
			PRINTF("write cw deadband complete\r\n");
		Delay(1000);
#endif

#if WRITE_TEST
    //Change the CCW deadband of servo ID1 to 0.2°.
    primary_servo_set_ccw_deadband(1, 2, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
		USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    ret = primary_servo_set_ccw_deadband_analysis(receive_data);
		if(ret == PRIMARY_SUCCESS)
			PRINTF("write ccw deadband complete\r\n");
		Delay(1000);
#endif

#if WRITE_TEST
    //Change the CW and CCW deadband of servo ID1 to 0.2°.
    write_buffer[0] = 2 & 0xff;
    write_buffer[1] = 2 & 0xff;
    primary_servo_write(1, 0x18, 2, write_buffer, order_buffer, &order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
		USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    PRINTF("write cw deadband and ccw deadband status packet: ");
		for (uint8_t i = 0; i < receive_len; i++)
		{
				PRINTF("0x%02x ", receive_data[i]);
		}
		PRINTF("\r\n");
		Delay(1000);
#endif

#if WRITE_TEST
    //Change the PWM punch of servo ID1 to 1%.
    primary_servo_set_pwm_punch(1, 10, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
		USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    ret = primary_servo_set_pwm_punch_analysis(receive_data);
		if(ret == PRIMARY_SUCCESS)
			PRINTF("write pwm punch complete\r\n");
		Delay(1000);
#endif

#if WRITE_TEST
    //Change the position control P gain of servo ID1 to 5995.
    primary_servo_set_position_control_p_gain(1, 5995, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
		USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    ret = primary_servo_set_position_control_p_gain_analysis(receive_data);
		if(ret == PRIMARY_SUCCESS)
			PRINTF("write position control p gain complete\r\n");
		Delay(1000);
#endif

#if WRITE_TEST
    //Change the position control D gain of servo ID1 to 5.
    primary_servo_set_position_control_i_gain(1, 5, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
		USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    ret = primary_servo_set_position_control_i_gain_analysis(receive_data);
		if(ret == PRIMARY_SUCCESS)
			PRINTF("write position control i gain complete\r\n");
		Delay(1000);
#endif

#if WRITE_TEST
    //Change the position control D gain of servo ID1 to 145.
    primary_servo_set_position_control_d_gain(1, 145, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
		USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    ret = primary_servo_set_position_control_d_gain_analysis(receive_data);
		if(ret == PRIMARY_SUCCESS)
			PRINTF("write position control d gain complete\r\n");
		Delay(1000);
#endif
		
#if WRITE_TEST
    //Change the position control PID gain of servo ID1 to 5995, 5, and 145 respectively.
    write_buffer[0] = 5995 & 0xff;
    write_buffer[1] = (5995 >> 8) & 0xff;
    write_buffer[2] = 5 & 0xff;
    write_buffer[3] = (5 >> 8) & 0xff;
    write_buffer[4] = 145 & 0xff;
    write_buffer[5] = (145 >> 8) & 0xff;
    primary_servo_write(1, 0x1B, 6, write_buffer, order_buffer, &order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
		USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

