EnergizeLab/ServoSDK/C/STM32F103C8T6/PrimaryMemoryTable/Example/User/main.c
    PRINTF("write position control pid gain status packet: ");
		for (uint8_t i = 0; i < receive_len; i++)
		{
				PRINTF("0x%02x ", receive_data[i]);
		}
		PRINTF("\r\n");
		Delay(1000);
#endif

#if WRITE_TEST
    //Change the LED condition of servo ID1 to turn on stall error, overheating error, and angle error.
    primary_servo_set_led_condition(1, 38, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
		USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    ret = primary_servo_set_led_condition_analysis(receive_data);
		if(ret == PRIMARY_SUCCESS)
			PRINTF("write led condition complete\r\n");
		Delay(1000);
#endif

#if WRITE_TEST
    //Change the shutdown condition of servo ID1 to turn on stall error, overheating error, voltage error, and angle error.
    primary_servo_set_shutdown_conditions(1, 39, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
		USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    ret = primary_servo_set_shutdown_conditions_analysis(receive_data);
		if(ret == PRIMARY_SUCCESS)
			PRINTF("write shutdown conditions complete\r\n");
		Delay(1000);
#endif

#if WRITE_TEST
    //Change the Flash switch of servo ID1 to ON.
    primary_servo_set_flash_switch(1, 1, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
		USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    ret = primary_servo_set_flash_switch_analysis(receive_data);
		if(ret == PRIMARY_SUCCESS)
			PRINTF("write flash switch complete\r\n");
		Delay(1000);
#endif
		
#if WRITE_TEST
    //Change the Flash switch of servo ID1 to OFF.
    primary_servo_set_flash_switch(1, 0, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
		USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    ret = primary_servo_set_flash_switch_analysis(receive_data);
		if(ret == PRIMARY_SUCCESS)
			PRINTF("write flash switch complete\r\n");
		Delay(1000);
#endif

#if WRITE_TEST
    //Change the LED switch of servo ID1 to ON.
    primary_servo_set_led_switch(1, 1, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
		USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    ret = primary_servo_set_led_switch_analysis(receive_data);
		if(ret == PRIMARY_SUCCESS)
			PRINTF("write led switch complete\r\n");
		Delay(1000);
#endif

#if WRITE_TEST
    //Change the LED switch of servo ID1 to OFF.
    primary_servo_set_led_switch(1, 0, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
		USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    ret = primary_servo_set_led_switch_analysis(receive_data);
		if(ret == PRIMARY_SUCCESS)
			PRINTF("write led switch complete\r\n");
		Delay(1000);
#endif
		
#if WRITE_TEST
    //Change the torque switch of servo ID1 to OFF.
    primary_servo_set_torque_switch(1, 0, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
		USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    ret = primary_servo_set_torque_switch_analysis(receive_data);
		if(ret == PRIMARY_SUCCESS)
			PRINTF("write torque switch complete\r\n");
		Delay(1000);
#endif

#if WRITE_TEST
    //Change the control mode of servo ID1 to the PWM control mode.
    primary_servo_set_control_mode(1, 3, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
		USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    ret = primary_servo_set_control_mode_analysis(receive_data);
		if(ret == PRIMARY_SUCCESS)
			PRINTF("write control mode complete\r\n");
		Delay(1000);
#endif

#if WRITE_TEST
    //Change the torque switch of servo ID1 to ON.
    primary_servo_set_torque_switch(1, 1, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
		USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    ret = primary_servo_set_torque_switch_analysis(receive_data);
		if(ret == PRIMARY_SUCCESS)
			PRINTF("write torque switch complete\r\n");
		Delay(1000);
#endif

#if WRITE_TEST
    //Change the target PWM of servo ID1 to -50%.
    primary_servo_set_target_pwm(1, -500, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
		USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    ret = primary_servo_set_target_pwm_analysis(receive_data);
		if(ret == PRIMARY_SUCCESS)
			PRINTF("write target pwm complete\r\n");
		Delay(3000);
#endif
		
		#if WRITE_TEST
    //Change the torque switch of servo ID1 to OFF.
    primary_servo_set_torque_switch(1, 0, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
		USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    ret = primary_servo_set_torque_switch_analysis(receive_data);
		if(ret == PRIMARY_SUCCESS)
			PRINTF("write torque switch complete\r\n");
		Delay(1000);
#endif

#if WRITE_TEST
    //Change the control mode of servo ID1 to the current control mode.
    primary_servo_set_control_mode(1, 2, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
		USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    ret = primary_servo_set_control_mode_analysis(receive_data);
		if(ret == PRIMARY_SUCCESS)
			PRINTF("write control mode complete\r\n");
		Delay(1000);
#endif

#if WRITE_TEST
    //Change the torque switch of servo ID1 to ON.
    primary_servo_set_torque_switch(1, 1, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
		USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

