EnergizeLab/ServoSDK/C/STM32F103C8T6/PrimaryMemoryTable/Example/User/main.c
    ret = primary_servo_set_torque_switch_analysis(receive_data);
		if(ret == PRIMARY_SUCCESS)
			PRINTF("write torque switch complete\r\n");
		Delay(1000);
#endif

#if WRITE_TEST
    //Change the target current of servo ID1 to -400mA.
    primary_servo_set_target_current(1, -400, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
		USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    ret = primary_servo_set_target_current_analysis(receive_data);
		if(ret == PRIMARY_SUCCESS)
			PRINTF("write target current complete\r\n");
		Delay(3000);
#endif
		
#if WRITE_TEST
    //Change the torque switch of servo ID1 to OFF.
    primary_servo_set_torque_switch(1, 0, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
		USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    ret = primary_servo_set_torque_switch_analysis(receive_data);
		if(ret == PRIMARY_SUCCESS)
			PRINTF("write torque switch complete\r\n");
		Delay(1000);
#endif

#if WRITE_TEST
    //Change the control mode of servo ID1 to the velocity base position control mode.
    primary_servo_set_control_mode(1, 1, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
		USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    ret = primary_servo_set_control_mode_analysis(receive_data);
		if(ret == PRIMARY_SUCCESS)
			PRINTF("write control mode complete\r\n");
		Delay(1000);
#endif

#if WRITE_TEST
    //Change the torque switch of servo ID1 to ON.
    primary_servo_set_torque_switch(1, 1, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
		USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    ret = primary_servo_set_torque_switch_analysis(receive_data);
		if(ret == PRIMARY_SUCCESS)
			PRINTF("write torque switch complete\r\n");
		Delay(1000);
#endif

#if WRITE_TEST
    //Change the velocity base target velocity of servo ID1 to 360°/s.
    primary_servo_set_velocity_base_target_velocity(1, 3600, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
		USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    ret = primary_servo_set_velocity_base_target_velocity_analysis(receive_data);
		if(ret == PRIMARY_SUCCESS)
			PRINTF("write velocity base target velocity complete\r\n");
		Delay(1000);
#endif

#if WRITE_TEST
    //Change the velocity base target ACC of servo ID1 to 500°/s².
    primary_servo_set_velocity_base_target_acc(1, 10, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
		USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    ret = primary_servo_set_velocity_base_target_acc_analysis(receive_data);
		if(ret == PRIMARY_SUCCESS)
			PRINTF("write velocity base target acc complete\r\n");
		Delay(1000);
#endif

#if WRITE_TEST
    //Change the velocity base target DEC of servo ID1 to 50°/s².
    primary_servo_set_velocity_base_target_dec(1, 1, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
		USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    ret = primary_servo_set_velocity_base_target_dec_analysis(receive_data);
		if(ret == PRIMARY_SUCCESS)
			PRINTF("write velocity base target dec complete\r\n");
		Delay(1000);
#endif

#if WRITE_TEST
    //Change the velocity base target position of servo ID1 to 150°.
    primary_servo_set_velocity_base_target_position(1, 1500, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
		USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    ret = primary_servo_set_velocity_base_target_position_analysis(receive_data);
		if(ret == PRIMARY_SUCCESS)
			PRINTF("write velocity base target position complete\r\n");
		Delay(1000);
#endif

#if WRITE_TEST
    //Change the torque switch of servo ID1 to OFF.
    primary_servo_set_torque_switch(1, 0, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
		USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    ret = primary_servo_set_torque_switch_analysis(receive_data);
		if(ret == PRIMARY_SUCCESS)
			PRINTF("write torque switch complete\r\n");
		Delay(1000);
#endif

#if WRITE_TEST
    //Change the control mode of servo ID1 to the time base position control mode.
    primary_servo_set_control_mode(1, 0, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
		USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    ret = primary_servo_set_control_mode_analysis(receive_data);
		if(ret == PRIMARY_SUCCESS)
			PRINTF("write control mode complete\r\n");
		Delay(1000);
#endif

#if WRITE_TEST
    //Change the torque switch of servo ID1 to ON.
    primary_servo_set_torque_switch(1, 1, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
		USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    ret = primary_servo_set_torque_switch_analysis(receive_data);
		if(ret == PRIMARY_SUCCESS)
			PRINTF("write torque switch complete\r\n");
		Delay(1000);
#endif
		
#if WRITE_TEST
    //Change the time base target ACC of servo ID1 to 5.
    primary_servo_set_time_base_target_acc(1, 5, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
		USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    ret = primary_servo_set_time_base_target_acc_analysis(receive_data);
		if(ret == PRIMARY_SUCCESS)
			PRINTF("write time base target acc complete\r\n");
		Delay(1000);
#endif

#if WRITE_TEST
    //Change the time base target position and moving time of servo ID1 to 300°, 500ms respectively.
    primary_servo_set_time_base_target_position_and_moving_time(1, 3000, 500, order_buffer,&order_len);
		GPIO_SetBits(GPIOA, GPIO_Pin_11);
		USART1_Send(order_buffer, order_len);

		GPIO_ResetBits(GPIOA, GPIO_Pin_11);
    receive_len = 0x00;
		Delay(10);

    ret = primary_servo_set_time_base_target_position_and_moving_time_analysis(receive_data);
		if(ret == PRIMARY_SUCCESS)
			PRINTF("write time base target position and moving time complete\r\n");
		Delay(1000);
#endif
	}
}

void RCC_Configuration(void)
{
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1 | RCC_APB2Periph_GPIOA |RCC_APB2Periph_AFIO, ENABLE);
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2, ENABLE);
}

void GPIO_Configuration(void)
{
  GPIO_InitTypeDef GPIO_InitStructure;

